app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY title
---
  def index
    @course = Course.find(params[:course_id])
    @id = params[:course_id]
    @posts = @course.posts.all.with_rich_text_content_and_embeds